# YOLO11n with CBAM and ASFF
# CBAM: 增强backbone特征
# ASFF: 自适应融合neck特征

# Parameters
nc: 559  # 类别数
scales:
  n: [0.50, 0.25, 1024]

# Backbone with CBAM
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, CBAMBottleneck, [256]]  # CBAM增强
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, CBAMBottleneck, [512]]  # CBAM增强
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, CBAMBottleneck, [512]]  # CBAM增强
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, C2PSA, [1024]]

# Head with ASFF (注意: ASFF需要特殊处理,这里先用标准结构)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]
  
  - [[19, 22, 25], 1, Detect, [nc]]
