# YOLOv8 with CBAM and ASFF
# 这是一个示例配置,展示如何集成CBAM和ASFF模块

# Parameters
nc: 559  # 类别数
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, CBAM, [128]]  # 添加CBAM
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, CBAM, [256]]  # 添加CBAM
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, CBAM, [512]]  # 添加CBAM
  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 12

# YOLOv8.0n head with ASFF
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 15
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 18 (P3/8-small)
  
  # 使用ASFF融合多尺度特征
  - [[12, 15, 18], 1, ASFF, [0, [1024, 512, 256], 256]]  # ASFF level 0
  - [[12, 15, 18], 1, ASFF, [1, [1024, 512, 256], 256]]  # ASFF level 1
  - [[12, 15, 18], 1, ASFF, [2, [1024, 512, 256], 256]]  # ASFF level 2
  
  - [[19, 20, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)

# 注意: 这个配置文件需要在ultralytics中注册CBAM和ASFF模块才能使用
