# YOLO11n with CBAM Attention
# 在关键层添加CBAM注意力机制,提升特征表达能力

# Parameters
nc: 559  # 类别数 (根据你的data.yaml修改)
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # YOLO11n

# YOLO11n backbone with CBAM
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, CBAM, [256]]  # 添加CBAM - 层3
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, CBAM, [512]]  # 添加CBAM - 层6
  - [-1, 1, Conv, [512, 3, 2]]  # 7-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, CBAM, [512]]  # 添加CBAM - 层9
  - [-1, 1, Conv, [1024, 3, 2]]  # 10-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 12
  - [-1, 1, C2PSA, [1024]]  # 13

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [512, False]]  # 16
  
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 2, C3k2, [256, False]]  # 19 (P3/8-small)
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 2, C3k2, [512, False]]  # 22 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P5
  - [-1, 2, C3k2, [1024, True]]  # 25 (P5/32-large)
  
  - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
